## Operações com Dataframes

In [1]:
import pandas as pd

### Parte 1

In [2]:
# Cria um dicionário com pares de chave e valor
stock = {'AMZN': pd.Series([346.15,0.59,459,0.52,589.8,158.88],
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E', 'Market Cap(B)']),
         'GOOG': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64],
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E', 'Market Cap(B)']),
         'FB': pd.Series([61.48,0.59,2450,104.93,150.92],
                         index = ['Closing price', 'EPS',' Shares Outstanding(M)', 'P/E', 'Market Cap(B)']),
         'YHOO': pd.Series([34.90,1.27,1010,27.48,0.66,35.36], 
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Beta', 'Market Cap(B)']),
         'TWTR':pd.Series([65.25,-0.3,555.2,36.23],
                          index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Market Cap(B)']),
         'AAPL':pd.Series([501.53,40.32,892.45,12.44,447.59,0.84],
                          index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)', 'Beta'])}

In [3]:
# tipo de objeto
type(stock)

dict

In [4]:
# Visualiza
stock

{'AMZN': Closing price            346.15
 EPS                        0.59
 Shares Outstanding(M)    459.00
 Beta                       0.52
 P/E                      589.80
 Market Cap(B)            158.88
 dtype: float64,
 'GOOG': Closing price            1133.43
 EPS                        36.05
 Shares Outstanding(M)     335.83
 Beta                        0.87
 P/E                        31.44
 Market Cap(B)             380.64
 dtype: float64,
 'FB': Closing price               61.48
 EPS                          0.59
  Shares Outstanding(M)    2450.00
 P/E                        104.93
 Market Cap(B)              150.92
 dtype: float64,
 'YHOO': Closing price              34.90
 EPS                         1.27
 Shares Outstanding(M)    1010.00
 P/E                        27.48
 Beta                        0.66
 Market Cap(B)              35.36
 dtype: float64,
 'TWTR': Closing price             65.25
 EPS                       -0.30
 Shares Outstanding(M)    555.20
 Market Cap(B)             36.23
 dtype: float64,
 'AAPL': Closing price            501.53
 EPS                       40.32
 Shares Outstanding(M)    892.45
 P/E                       12.44
 Market Cap(B)            447.59
 Beta                       0.84
 dtype: float64}

In [5]:
# Converte o dicionário em dataframe do pandas
stock_df = pd.DataFrame(stock)

In [6]:
stock_df.head(6)

                          AMZN     GOOG       FB   YHOO   TWTR    AAPL
 Shares Outstanding(M)     NaN      NaN  2450.00    NaN    NaN     NaN
Beta                      0.52     0.87      NaN   0.66    NaN    0.84
Closing price           346.15  1133.43    61.48  34.90  65.25  501.53
EPS                       0.59    36.05     0.59   1.27  -0.30   40.32
Market Cap(B)           158.88   380.64   150.92  35.36  36.23  447.59
P/E                     589.80    31.44   104.93  27.48    NaN   12.44

In [7]:
# Fazendo a transposta
stock_df.T

,Shares Outstanding(M),Beta,Closing price,EPS,Market Cap(B),P/E,Shares Outstanding(M)
AMZN,NaN,0.52,346.15,0.59,158.88,589.80,459.00
GOOG,NaN,0.87,1133.43,36.05,380.64,31.44,335.83
FB,2450.0,NaN,61.48,0.59,150.92,104.93,NaN
YHOO,NaN,0.66,34.90,1.27,35.36,27.48,1010.00
TWTR,NaN,NaN,65.25,-0.30,36.23,NaN,555.20
AAPL,NaN,0.84,501.53,40.32,447.59,12.44,892.45

In [8]:
stock_df

                          AMZN     GOOG       FB     YHOO    TWTR    AAPL
 Shares Outstanding(M)     NaN      NaN  2450.00      NaN     NaN     NaN
Beta                      0.52     0.87      NaN     0.66     NaN    0.84
Closing price           346.15  1133.43    61.48    34.90   65.25  501.53
EPS                       0.59    36.05     0.59     1.27   -0.30   40.32
Market Cap(B)           158.88   380.64   150.92    35.36   36.23  447.59
P/E                     589.80    31.44   104.93    27.48     NaN   12.44
Shares Outstanding(M)   459.00   335.83      NaN  1010.00  555.20  892.45

In [9]:
# Podemos converter o dicionário em dataframe definindo quais são os índices de cada linha e a ordem desehada
stock_df = pd.DataFrame(stock,
                       index = ['Closing price',
                               'EPS',
                               'Shares Outstanding',
                               'P/E',
                               'Market Cap(B)',
                                'Beta'])

In [10]:
stock_df.head(6)

                      AMZN     GOOG      FB   YHOO   TWTR    AAPL
Closing price       346.15  1133.43   61.48  34.90  65.25  501.53
EPS                   0.59    36.05    0.59   1.27  -0.30   40.32
Shares Outstanding     NaN      NaN     NaN    NaN    NaN     NaN
P/E                 589.80    31.44  104.93  27.48    NaN   12.44
Market Cap(B)       158.88   380.64  150.92  35.36  36.23  447.59
Beta                  0.52     0.87     NaN   0.66    NaN    0.84

In [11]:
# Podemos converter o dicionário em dataframe definindo quais são os índices de cada linha e os títulos das colunas
stock_df = pd.DataFrame(stock,
                       index = ['Closing price',
                               'EPS',
                               'Shares Outstanding',
                               'P/E',
                               'Market Cap(B)',
                                'Beta'],
                       columns = ['AMZN', 'GOOG', 'FB'])

In [12]:
stock_df.head(6)

                      AMZN     GOOG      FB
Closing price       346.15  1133.43   61.48
EPS                   0.59    36.05    0.59
Shares Outstanding     NaN      NaN     NaN
P/E                 589.80    31.44  104.93
Market Cap(B)       158.88   380.64  150.92
Beta                  0.52     0.87     NaN

### Parte 2

In [13]:
# Dicionário
Quadro_Medalhas_Olimpiada = {
    'EUA' : {'Ouro':46, 'Prata':37, 'Bronze':38},
    'China':{'Ouro':26, 'Prata':18, 'Bronze':26},
    'Inglaterra':{'Ouro':27, 'Prata':23, 'Bronze':17},
    'Alemanha':{'Ouro':19, 'Prata':18, 'Bronze':19},
    'Uruguai':{'Ouro':17, 'Prata':10, 'Bronze':15}}

In [14]:
# Converte para dataframe
df_olimpiada = pd.DataFrame.from_dict(Quadro_Medalhas_Olimpiada)

In [15]:
type(df_olimpiada)

pandas.core.frame.DataFrame

In [16]:
df_olimpiada.head()

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [17]:
df_olimpiada['China']

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [18]:
Medalhas_China = df_olimpiada['China']

In [19]:
type(Medalhas_China)

pandas.core.series.Series

In [20]:
Medalhas_China

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [21]:
df_olimpiada.Uruguai

Ouro      17
Prata     10
Bronze    15
Name: Uruguai, dtype: int64

In [22]:
df_olimpiada[['Inglaterra', 'Alemanha']]

        Inglaterra  Alemanha
Ouro            27        19
Prata           23        18
Bronze          17        19

In [23]:
df_olimpiada.get('Inglaterra')

Ouro      27
Prata     23
Bronze    17
Name: Inglaterra, dtype: int64

In [24]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

### Parte 3

In [25]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [26]:
df_olimpiada[:2]

       EUA  China  Inglaterra  Alemanha  Uruguai
Ouro    46     26          27        19       17
Prata   37     18          23        18       10

In [27]:
df_olimpiada[2:]

        EUA  China  Inglaterra  Alemanha  Uruguai
Bronze   38     26          17        19       15

In [28]:
df_olimpiada[::2]

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Bronze   38     26          17        19       15

In [29]:
df_olimpiada.loc['Ouro']

EUA           46
China         26
Inglaterra    27
Alemanha      19
Uruguai       17
Name: Ouro, dtype: int64

In [30]:
df_olimpiada.loc[:,'EUA']

Ouro      46
Prata     37
Bronze    38
Name: EUA, dtype: int64

In [31]:
df_olimpiada.loc['Prata', 'China']

18

In [32]:
df_olimpiada.loc['Prata']['China']

18

In [33]:
df_olimpiada.loc['Prata']

EUA           37
China         18
Inglaterra    23
Alemanha      18
Uruguai       10
Name: Prata, dtype: int64

In [34]:
df_olimpiada.loc['Ouro'] > 20

EUA            True
China          True
Inglaterra     True
Alemanha      False
Uruguai       False
Name: Ouro, dtype: bool

In [35]:
df_olimpiada.loc['Ouro', df_olimpiada.loc['Ouro'] > 20]

EUA           46
China         26
Inglaterra    27
Name: Ouro, dtype: int64

In [36]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [37]:
df_olimpiada.loc['Ouro']

EUA           46
China         26
Inglaterra    27
Alemanha      19
Uruguai       17
Name: Ouro, dtype: int64

In [38]:
df_olimpiada.iloc[:,1]

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [39]:
df_olimpiada.iloc[1,3]

18

In [40]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [41]:
df_olimpiada.index

Index(['Ouro', 'Prata', 'Bronze'], dtype='object')

In [42]:
# Medalhas da China maiores que 20
df_olimpiada.loc[df_olimpiada['China'] > 20, 'China']

Ouro      26
Bronze    26
Name: China, dtype: int64

In [43]:
# Medalhas de Bronze maiores que 25
df_olimpiada.loc['Bronze', df_olimpiada.loc['Bronze'] > 20]

EUA      38
China    26
Name: Bronze, dtype: int64

In [44]:
# Medalhas da China e Inglaterra em que ambos são maiores que 20
df_olimpiada.loc[(df_olimpiada['China'] > 20) & (df_olimpiada['Inglaterra'] > 20), ['China', 'Inglaterra']]

      China  Inglaterra
Ouro     26          27

In [45]:
# Filtrar medalhas dos EUA maiores que 40 e da Inglaterra maiores que 20
df_olimpiada.loc[(df_olimpiada['EUA'] > 40) & (df_olimpiada['Inglaterra'] > 20), ['EUA', 'Inglaterra']]

      EUA  Inglaterra
Ouro   46          27

In [46]:
df_olimpiada['EUA'].sum()

121

In [47]:
# Informações só de EUA e Inglaterra
df_olimpiada.iloc[:, 0:3:2]

        EUA  Inglaterra
Ouro     46          27
Prata    37          23
Bronze   38          17

In [48]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

Podemos ainda deletar e inserir partes de um dataframe.

In [57]:
del df_olimpiada['Brasil']

In [58]:
df_olimpiada

        China  Inglaterra  Alemanha  Uruguai
Ouro       26          27        19       17
Prata      18          23        18       10
Bronze     26          17        19       15

In [59]:
df_olimpiada.insert(3, 'Brasil', (17, 16, 23))

In [60]:
df_olimpiada

        China  Inglaterra  Alemanha  Brasil  Uruguai
Ouro       26          27        19      17       17
Prata      18          23        18      16       10
Bronze     26          17        19      23       15

In [61]:
df_olimpiada.describe()

           China  Inglaterra   Alemanha     Brasil    Uruguai
count   3.000000    3.000000   3.000000   3.000000   3.000000
mean   23.333333   22.333333  18.666667  18.666667  14.000000
std     4.618802    5.033223   0.577350   3.785939   3.605551
min    18.000000   17.000000  18.000000  16.000000  10.000000
25%    22.000000   20.000000  18.500000  16.500000  12.500000
50%    26.000000   23.000000  19.000000  17.000000  15.000000
75%    26.000000   25.000000  19.000000  20.000000  16.000000
max    26.000000   27.000000  19.000000  23.000000  17.000000